<a href="https://colab.research.google.com/github/TayBoaes/WoMakersCode-SQL/blob/main/wmc_exercicio_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1. Crie uma tabela chamada "alunos" com os seguintes campos: id
(inteiro), nome (texto), idade (inteiro) e curso (texto).

In [ ]:
import sqlite3

In [ ]:
conexao = sqlite3.connect ('banco_exercicio_2')
cursor = conexao.cursor()

In [ ]:
cursor.execute ('CREATE TABLE alunos (id INT, nome VARCHAR (100), idade INT, curso VARCHAR (100))')

2. Insira pelo menos 5 registros de alunos na tabela que você criou no
exercício anterior

In [ ]:
cursor.execute ('INSERT INTO alunos (id,nome,idade,curso) VALUES (1, "Tayná", 28, "Análise de dados")')
cursor.execute ('INSERT INTO alunos (id,nome,idade,curso) VALUES (2, "Caynã", 26, "Engenharia")')
cursor.execute ('INSERT INTO alunos (id,nome,idade,curso) VALUES (3, "Kauê", 18, "Administração")')
cursor.execute ('INSERT INTO alunos (id,nome,idade,curso) VALUES (4, "Júlia", 51, "Veterinária")')
cursor.execute ('INSERT INTO alunos (id,nome,idade,curso) VALUES (5, "Pedro", 30, "Engenharia")')

3. Consultas Básicas
Escreva consultas SQL para realizar as seguintes tarefas:
a) Selecionar todos os registros da tabela "alunos".
b) Selecionar o nome e a idade dos alunos com mais de 20 anos.
c) Selecionar os alunos do curso de "Engenharia" em ordem
alfabética.
d) Contar o número total de alunos na tabela

In [ ]:
#a) Selecionar todos os registros da tabela "alunos"
cursor.execute ('SELECT * FROM alunos' ) #verificando a minha tabela e a mudança feita
print (cursor.fetchall())

[(1, 'Tayná', 28, 'Análise de dados'), (2, 'Caynã', 26, 'Engenharia'), (3, 'Kauê', 18, 'Administração'), (4, 'Júlia', 51, 'Veterinária'), (5, 'Pedro', 30, 'Engenharia')]

In [ ]:
#b)Selecionar o nome e a idade dos alunos com mais de 20 anos

# Query usando o Igual ">"
consulta = cursor.execute(
    '''
SELECT * FROM alunos
WHERE idade >=20
    '''
).fetchall()

print (consulta)

[(1, 'Tayná', 28, 'Análise de dados'), (2, 'Caynã', 26, 'Engenharia'), (4, 'Júlia', 51, 'Veterinária'), (5, 'Pedro', 30, 'Engenharia')]

In [ ]:
# c) Selecionar os alunos do curso de "Engenharia" em ordem alfabética

#Vou inserir mais dados para poder responder essa questão. Para isso vou usar o comando: INSERT INTO

cursor.execute('INSERT INTO alunos (id, nome, idade, curso) VALUES (6, "Lidy",16,"Engenharia")')
cursor.execute('INSERT INTO alunos (id, nome, idade, curso) VALUES (7, "Livia",18,"Engenharia")')
cursor.execute('INSERT INTO alunos (id, nome, idade, curso) VALUES (8, "Beatriz",19,"Ciências Sociais")')

In [ ]:
cursor.execute ('SELECT * FROM alunos' ) #verificando a minha tabela e a mudança feita
print (cursor.fetchall())

[(1, 'Tayná', 28, 'Análise de dados'), (2, 'Caynã', 26, 'Engenharia'), (3, 'Kauê', 18, 'Administração'), (4, 'Júlia', 51, 'Veterinária'), (5, 'Pedro', 30, 'Engenharia'), (6, 'Lidy', 16, 'Engenharia'), (7, 'Livia', 18, 'Engenharia'), (8, 'Beatriz', 19, 'Ciências Sociais')]

In [ ]:
alfabetica = cursor.execute(
    '''
SELECT nome AS 'Nome' FROM alunos
WHERE curso = 'Engenharia'
ORDER BY nome;
    '''
).fetchall()

print (alfabetica)

[('Caynã',), ('Lidy',), ('Livia',), ('Pedro',)]

In [ ]:
 #d) Contar o número total de alunos na tabela

 total_alunos = cursor.execute(
     '''
     SELECT COUNT (id) as 'Identificação'
     FROM alunos;
     '''
 ).fetchall()
 print ('O total de alunos é:',total_alunos)

O total de alunos é: [(8,)]

4. Atualização e Remoção
a) Atualize a idade de um aluno específico na tabela.
b) Remova um aluno pelo seu ID.

In [ ]:
# a) Atualize a idade de um aluno específico na tabela
cursor.execute(
    '''
    UPDATE alunos
    SET idade = 27
    WHERE nome = "Caynã"
    '''
).fetchall

 #ficar atenta às aspas

In [ ]:
#vamos visualizar a mudança
dados = cursor.execute (
    '''
    SELECT * FROM alunos
    '''
)

for alunos in dados:
  print(alunos)

(1, 'Tayná', 28, 'Análise de dados')
(2, 'Caynã', 27, 'Engenharia')
(3, 'Kauê', 18, 'Administração')
(4, 'Júlia', 51, 'Veterinária')
(5, 'Pedro', 30, 'Engenharia')
(6, 'Lidy', 16, 'Engenharia')
(7, 'Livia', 18, 'Engenharia')
(8, 'Beatriz', 19, 'Ciências Sociais')

In [ ]:
#b) Remova um aluno pelo seu ID
cursor.execute ('DELETE FROM alunos where id =6')

In [ ]:
#vamos visualizar a mudança
dados = cursor.execute (
    '''
    SELECT * FROM alunos
    '''
)

for alunos in dados:
  print(alunos) #o id 6 foi excluído

(1, 'Tayná', 28, 'Análise de dados')
(2, 'Caynã', 27, 'Engenharia')
(3, 'Kauê', 18, 'Administração')
(4, 'Júlia', 51, 'Veterinária')
(5, 'Pedro', 30, 'Engenharia')
(7, 'Livia', 18, 'Engenharia')
(8, 'Beatriz', 19, 'Ciências Sociais')

5. Criar uma Tabela e Inserir Dados
Crie uma tabela chamada "clientes" com os campos: id (chave
primária), nome (texto), idade (inteiro) e saldo (float). Insira alguns
registros de clientes na tabela.

In [ ]:
#criando a tabela clientes
cursor.execute ('CREATE TABLE clientes (id INT, nome VARCHAR (100), idade INT, saldo FLOAT)')

In [ ]:
#Inserindo alguns registros na tabela

cursor.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES (1, "Mirna",18,"1000")')
cursor.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES (2, "Beatriz",32,"2000")')
cursor.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES (3, "Ramilda",25,"500")')
cursor.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES (4, "Lucas",40,"5000")')
cursor.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES (5, "Pedro",36,"100")')
cursor.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES (6, "Debora",50,"800")')

In [ ]:
#vamos visualizar a nossa tabela
dados_clientes = cursor.execute (
    '''
    SELECT * FROM clientes
    '''
)

for clientes in dados_clientes:
  print(clientes)

(1, 'Mirna', 18, 1000.0)
(2, 'Beatriz', 32, 2000.0)
(3, 'Ramilda', 25, 500.0)
(4, 'Lucas', 40, 5000.0)
(5, 'Pedro', 36, 100.0)
(6, 'Debora', 50, 800.0)

In [ ]:
dados_clientes = cursor.execute (
    '''
    SELECT * FROM cliente
    '''
)

for cliente in dados_clientes:
  print(cliente) #o id 6 foi excluído

6. Consultas e Funções Agregadas
Escreva consultas SQL para realizar as seguintes tarefas:
a) Selecione o nome e a idade dos clientes com idade superior a
30 anos b) Calcule o saldo médio dos clientes.
c) Encontre o cliente com o saldo máximo.
d) Conte quantos clientes têm saldo acima de 1000.

In [ ]:
#a) Selecione o nome e a idade dos clientes com idade superior a 30 anos

dados_clientes = cursor.execute (
    '''
    SELECT nome FROM clientes
    WHERE idade > 30

    '''
).fetchall()
print ('Clientes com idade superior a 30 anos:',dados_clientes)

Clientes com idade superior a 30 anos: [('Beatriz',), ('Lucas',), ('Pedro',), ('Debora',)]

In [ ]:
#b) Calcule o saldo médio dos clientes

dados_clientes = cursor.execute (
    '''
    SELECT AVG (saldo)
    FROM clientes

    '''
).fetchall()
print ('O saldo médio dos clientes é:',dados_clientes)

O saldo médio dos clientes é: [(1566.6666666666667,)]

In [ ]:
#c) Encontre o cliente com o saldo máximo
dados_clientes = cursor.execute (
    '''
    SELECT nome,
    MAX (saldo)
    FROM clientes
    '''
).fetchall()
print ('O cliente com o saldo máximo é:',dados_clientes)

O cliente com o saldo máximo é: [('Lucas', 5000.0)]

In [ ]:
#d) Conte quantos clientes têm saldo acima de 1000
dados_clientes = cursor.execute (
    '''
    SELECT COUNT (id)
    FROM clientes
    WHERE saldo > 1000

    '''
).fetchall()
print ('Total de clientes com saldo maior que 1000:',dados_clientes)

Total de clientes com saldo maior que 1000: [(2,)]

7. Atualização e Remoção com Condições
a) Atualize o saldo de um cliente específico.
b) Remova um cliente pelo seu ID.

In [ ]:
#a) Atualize o saldo de um cliente específico
cursor.execute(
    '''
    UPDATE clientes
    SET saldo = 7000
    WHERE nome = "Pedro"
    '''
).fetchall

In [ ]:
#b) Remova um cliente pelo seu ID
cursor.execute ('DELETE FROM clientes where id =6')

In [ ]:
cursor.execute ('SELECT * FROM clientes' ) #verificando a minha tabela e a mudança feita
print (cursor.fetchall())

[(1, 'Mirna', 18, 1000.0), (2, 'Beatriz', 32, 2000.0), (3, 'Ramilda', 25, 500.0), (4, 'Lucas', 40, 5000.0), (5, 'Pedro', 36, 7000.0)]

8. Junção de Tabelas
Crie uma segunda tabela chamada "compras" com os campos: id
(chave primária), cliente_id (chave estrangeira referenciando o id
da tabela "clientes"), produto (texto) e valor (real). Insira algumas
compras associadas a clientes existentes na tabela "clientes".
Escreva uma consulta para exibir o nome do cliente, o produto e o
valor de cada compra

In [ ]:
#Criando a tabela chamada "Compras"
cursor.execute ('CREATE TABLE compras (id INT, cliente_id INT, produto VARCHAR (100), valor REAL )')

In [ ]:
#Inserindo algumas compras associadas a clientes existentes na tabela "clientes"
cursor.execute('INSERT INTO compras (id, cliente_id, produto, valor) VALUES (1, 1,"vassoura","70")')
cursor.execute('INSERT INTO compras (id, cliente_id, produto, valor) VALUES (2, 2,"toalha","10")')
cursor.execute('INSERT INTO compras (id, cliente_id, produto, valor) VALUES (3, 3,"lixeira","25")')
cursor.execute('INSERT INTO compras (id, cliente_id, produto, valor) VALUES (4, 4,"caneta","52")')
cursor.execute('INSERT INTO compras (id, cliente_id, produto, valor) VALUES (5, 5,"caderno","93")')

In [ ]:
#Escreva uma consulta para exibir o nome do cliente, o produto e o valor de cada compra
consulta = cursor.execute (
    '''
    SELECT nome, produto, valor
    FROM clientes
    INNER JOIN compras
    ON clientes.id = compras.cliente_id
    '''
).fetchall()
print (consulta)

[('Mirna', 'vassoura', 70.0), ('Beatriz', 'toalha', 10.0), ('Ramilda', 'lixeira', 25.0), ('Lucas', 'caneta', 52.0), ('Pedro', 'caderno', 93.0)]

In [ ]:
cursor.execute ('SELECT * FROM compras' ) #verificando a minha tabela e a mudança feita
print (cursor.fetchall())

[(1, 1, 'vassoura', 70.0), (2, 2, 'toalha', 10.0), (3, 3, 'lixeira', 25.0), (4, 4, 'caneta', 52.0), (5, 5, 'caderno', 93.0)]

In [ ]:
conexao.commit() #o commit quer dizer que vão ser enviadas as informações
conexao.close